// This Source Code Form is subject to the terms of the 
// Mozilla Public License, v.2.0. If a copy of the MPL 
// was not distributed with this file, You can obtain one 
// at http://mozilla.org/MPL/2.0/.

Функция РазобратьВерсию(Знач ВерсияСтрока) Экспорт
	
	Результат = Новый Структура("Мажор, Минор, Патч, Сборка, МеткаВыпуска, Метаданные");
	
	ПодСтроки = СтрРазделить(ВерсияСтрока, "+");
	Если Подстроки.Количество() > 1 Тогда
		Результат.Метаданные = ПодСтроки.Получить(1);
	КонецЕсли;
		
	ВерсияСтрока = ПодСтроки.Получить(0);
	ПозицияЧерта = СтрНайти(ВерсияСтрока, "-");
	Если Не ПозицияЧерта = 0 Тогда
		
		Результат.МеткаВыпуска = Сред(ВерсияСтрока, ПозицияЧерта + 1);
		ВерсияСтрока = Лев(ВерсияСтрока, ПозицияЧерта - 1);
		 
	КонецЕсли;
	
	СоставВерсии = СтрРазделить(ВерсияСтрока, ".");
	Если СоставВерсии.Количество() > 3 Тогда
		Результат.Сборка = Число(СоставВерсии.Получить(3));
	КонецЕсли;
	
	Результат.Мажор = Число(СоставВерсии.Получить(0));
	Результат.Минор = Число(СоставВерсии.Получить(1));
	Результат.Патч  = Число(СоставВерсии.Получить(2));
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции
