// This Source Code Form is subject to the terms of the 
// Mozilla Public License, v.2.0. If a copy of the MPL 
// was not distributed with this file, You can obtain one 
// at http://mozilla.org/MPL/2.0/.

Функция ПолучитьВерсиюСОфициальногоСайта(Знач Версия, Знач АдресХранилища = Неопределено) Экспорт
	
	ВерсияОбъект = СемантическоеВерсионирование.РазобратьВерсию(Версия);
	ПутьКФайлу = СтрШаблон("/downloads/%1_%2_%3/OneScript-%1.%2.%3.zip",
			ВерсияОбъект.Мажор,
			ВерсияОбъект.Минор,
			ВерсияОбъект.Патч);
			
	Соединение = Новый HTTPСоединение("oscript.io");
	ЗапросРесурса = Новый HTTPЗапрос(ПутьКФайлу);
	
	Ответ = Соединение.Получить(ЗапросРесурса);
	Возврат ПоместитьВоВременноеХранилище(Ответ.ПолучитьТелоКакДвоичныеДанные(), АдресХранилища);
	
КонецФункции
